{
  "<SOS>": 0,
  "<EOS>": 1,
  "<PAD>": 2,
  "<UNK>": 3,
  "{": 4,
  "}": 5,
  "_": 6,
  "^": 7,
  "(": 8,
  ")": 9,
  "2": 10,
  "1": 11,
  "-": 12,
  "=": 13,
  ",": 14,
  "+": 15,
  "a": 16,
  "i": 17,
  "r": 18,
  "0": 19,
  "\\frac": 20,
  "e": 21,
  "n": 22,
  ".": 23,
  "d": 24,
  "x": 25,
  "\\label": 26,
  "\\,": 27,
  "\\mu": 28,
  "m": 29,
  "t": 30,
  "c": 31,
  "\\left": 32,
  "\\right": 33,
  "k": 34,
  "p": 35,
  "3": 36,
  "&": 37,
  "s": 38,
  "4": 39,
  "y": 40,
  "l": 41,
  "\\alpha": 42,
  "\\partial": 43,
  "A": 44,
  "g": 45,
  "q": 46,
  "j": 47,
  "\\;": 48,
  "b": 49,
  "]": 50,
  "[": 51,
  "~": 52,
  "f": 53,
  "\\over": 54,
  "z": 55,
  "\\nu": 56,
  "|": 57,
  "\\pi": 58,
  "\\ ": 59,
  "o": 60,
  "\\phi": 61,
  "'": 62,
  "N": 63,
  "u": 64,
  "\\cal": 65,
  "\\delta": 66,
  "S": 67,
  "\\lambda": 68,
  "T": 69,
  "R": 70,
  "D": 71,
  "\\beta": 72,
  "\\bar": 73,
  "\\int": 74,
  "M": 75,
  "L": 76,
  "B": 77,
  "F": 78,
  "h": 79,
  "\\theta": 80,
  "\\sigma": 81,
  "/": 82,
  "\\\\": 83,
  "\\gamma": 84,
  "\\hat": 85,
  "H": 86,
  "\\psi": 87,
  "\\sqrt": 88,
  "\\sum": 89,
  "\\rm": 90,
  "C": 91,
  "\\rho": 92,
  "\\tilde": 93,
  "5": 94,
  "v": 95,
  "I": 96,
  "P": 97,
  "G": 98,
  "E": 99,
  "\\tau": 100,
  "V": 101,
  "X": 102,
  ":": 103,
  "\\omega": 104,
  "\\epsilon": 105,
  "J": 106,
  "\\bf": 107,
  "6": 108,
  "\\eta": 109,
  "Q": 110,
  "\\xi": 111,
  "\\Phi": 112,
  "\\quad": 113,
  "K": 114,
  "\\vec": 115,
  "\\{": 116,
  "\\Gamma": 117,
  "w": 118,
  "\\infty": 119,
  "8": 120,
  "\\}": 121,
  "U": 122,
  "W": 123,
  "\\begin": 124,
  "\\end": 125,
  "\\prime": 126,
  "\\rangle": 127,
  "Z": 128,
  "\\dot": 129,
  "\\pm": 130,
  "\\Lambda": 131,
  "*": 132,
  "\\varphi": 133,
  "\\Delta": 134,
  "\\chi": 135,
  ";": 136,
  "\\!": 137,
  "\\Omega": 138,
  "\\kappa": 139,
  "\\mbox": 140,
  "\\cdot": 141,
  "\\qquad": 142,
  "\\Psi": 143,
  "7": 144,
  "\\equiv": 145,
  "\\langle": 146,
  ">": 147,
  "\\overline": 148,
  "$": 149,
  "9": 150,
  "O": 151,
  "<": 152,
  "\\dagger": 153,
  "\\zeta": 154,
  "\\cdots": 155,
  "\\varepsilon": 156,
  "Y": 157,
  "\\rightarrow": 158,
  "\\exp": 159,
  "\\nabla": 160,
  "\\ldots": 161,
  "\\ln": 162,
  "\\Sigma": 163,
  "\\sin": 164,
  "\\ell": 165,
  "\\mathcal": 166,
  "\\cr": 167,
  "\\:": 168,
  "\\cos": 169,
  "\\otimes": 170,
  "!": 171,
  "\\prod": 172,
  "\\wedge": 173,
  "\\Pi": 174,
  "\\hbar": 175,
  "\\sim": 176,
  "\\displaystyle": 177,
  "\\Big": 178,
  "\\in": 179,
  "\\vert": 180,
  "\\widetilde": 181,
  "\\hspace": 182,
  "\\times": 183,
  "\\Theta": 184,
  "\\underline": 185,
  "\\mid": 186,
  "\\to": 187,
  "\\dots": 188,
  "\\mathbf": 189,
  "\\mathrm": 190,
  "\\ast": 191,
  "\\log": 192,
  "\\limits": 193,
  "\\sinh": 194,
  "\\leq": 195,
  "\\stackrel": 196,
  "\\cosh": 197,
  "\\star": 198,
  "\\approx": 199,
  "\\big": 200,
  "\\perp": 201,
  "\\widehat": 202,
  "\\lim": 203,
  "\\det": 204,
  "\\vartheta": 205,
  "\\Bigr": 206,
  "\\dag": 207,
  "\\geq": 208,
  "\\mp": 209,
  "\\Bigl": 210,
  "\\neq": 211,
  "\\textstyle": 212,
  "\\simeq": 213,
  "\\circ": 214,
  "\\bigg": 215,
  "\\biggl": 216,
  "\\biggr": 217,
  "\\hbox": 218,
  "\\oint": 219,
  "\\longrightarrow": 220,
  "\\pmatrix": 221,
  "\\not": 222,
  "\\>": 223,
  "\\boldmath": 224,
  "\\bigr": 225,
  "\\oplus": 226,
  "\\ddot": 227,
  "\\bigl": 228,
  "\\matrix": 229,
  "\\nonumber": 230,
  "\\Xi": 231,
  "\\|": 232,
  "\\put": 233,
  "\\hskip": 234,
  "\\le": 235,
  "\\check": 236,
  "\\propto": 237,
  "\\triangle": 238,
  "\\vdots": 239,
  "\\hline": 240,
  "\\imath": 241,
  "\\varrho": 242,
  "\\sp": 243,
  "\\ge": 244,
  "\\Bigg": 245,
  "\\tan": 246,
  "\\forall": 247,
  "\\leftrightarrow": 248,
  "\\iota": 249,
  "\\scriptscriptstyle": 250,
  "\\bot": 251,
  "\\tanh": 252,
  "\\parallel": 253,
  "\\textrm": 254,
  "\\lbrack": 255,
  "\\scriptsize": 256,
  "\\subset": 257,
  "\\line": 258,
  "\\it": 259,
  "\\phantom": 260,
  "\\Rightarrow": 261,
  "\\scriptstyle": 262,
  "\\mapsto": 263,
  "\\sf": 264,
  "\\jmath": 265,
  "\\atop": 266,
  "\\choose": 267,
  "\\ddots": 268,
  "\\Biggr": 269,
  "\\ne": 270,
  "\\l": 271,
  "\\tiny": 272,
  "\\Biggl": 273,
  "\\overrightarrow": 274,
  "\\Upsilon": 275,
  "\\d": 276,
  "\\wp": 277,
  "\\bullet": 278,
  "\\kern": 279,
  "\\ll": 280,
  "\\downarrow": 281,
  "\\gg": 282,
  "\\breve": 283,
  "\\uparrow": 284,
  "\\cong": 285,
  "\\L": 286,
  "\\coth": 287,
  "\\vee": 288,
  "\\o": 289,
  "\\bigoplus": 290,
  "\\cot": 291,
  "\\Im": 292,
  "\\small": 293,
  "\\underbrace": 294,
  "\\rbrack": 295,
  "\\cap": 296,
  "\\varpi": 297,
  "\\sb": 298,
  "\\arctan": 299,
  "\\mathsf": 300,
  "\\cup": 301,
  "\\makebox": 302,
  "\\lbrace": 303,
  "\\rbrace": 304,
  "\\upsilon": 305,
  "\\slash": 306,
  "\\vspace": 307,
  "\\Re": 308,
  "\\": 309,
  "\\#": 310,
  "\\Longrightarrow": 311,
  "\\mit": 312,
  "\\cases": 313,
  "\\rightharpoonup": 314,
  "\\supset": 315,
  "\\acute": 316,
  "\\raisebox": 317,
  "\\varsigma": 318,
  "\\mathop": 319,
  "\\min": 320,
  "@": 321,
  "\\noalign": 322,
  "\\Leftrightarrow": 323,
  "\\longleftrightarrow": 324,
  "\\S": 325,
  "\\dim": 326,
  "¥": 327,
  "\\large": 328,
  "\\bigtriangleup": 329,
  "\\circle": 330,
  "\\O": 331,
  "\\null": 332,
  "\\footnotesize": 333,
  "\"": 334,
  "\\raise": 335,
  "\\buildrel": 336,
  "\\protect": 337,
  "\\Large": 338,
  "\\vphantom": 339,
  "\\_": 340,
  "\\i": 341,
  "\\leftarrow": 342,
  "\\Vert": 343,
  "\\llap": 344,
  "`": 345,
  "\\Longleftrightarrow": 346,
  "\\enspace": 347,
  "\\sl": 348,
  "\\overleftarrow": 349,
  "\\max": 350,
  "\\hfill": 351,
  "\\tt": 352,
  "\\rfloor": 353,
  "\\rule": 354,
  "\\diamond": 355,
  "\\P": 356,
  "\\bigotimes": 357,
  "\\doteq": 358,
  "\\textbf": 359,
  "\\cdotp": 360,
  "\\deg": 361,
  "\\ref": 362,
  "\\emptyset": 363,
  "\\unitlength": 364,
  "\\fbox": 365,
  "\\thinspace": 366,
  "\\backslash": 367,
  "\\sharp": 368,
  "\\longmapsto": 369,
  "\\-": 370,
  "\\aleph": 371,
  "\\textup": 372,
  "\\subseteq": 373,
  "\\relax": 374,
  "\\longleftarrow": 375,
  "\\vskip": 376,
  "\\overbrace": 377,
  "\\vline": 378,
  "\\mathit": 379,
  "\\arg": 380,
  "\\flat": 381,
  "\\c": 382,
  "\\bigcup": 383,
  "\\ni": 384,
  "\\odot": 385,
  "\\setlength": 386,
  "\\colon": 387,
  "\\/": 388,
  "\\vrule": 389,
  "\\strut": 390,
  "\\smallskip": 391,
  "\\lfloor": 392,
  "\\bigwedge": 393,
  "\\medskip": 394,
  "\\multicolumn": 395,
  "\\pounds": 396,
  "\\ominus": 397,
  "\\enskip": 398,
  "\\nolimits": 399,
  "\\land": 400,
  "\\sup": 401,
  "\\parbox": 402,
  "\\bmod": 403,
  "\\j": 404,
  "\\hookrightarrow": 405,
  "\\bigtriangledown": 406,
  "\\arcsin": 407,
  "\\*": 408,
  "\\vbox": 409,
  "\\arraystretch": 410,
  "\\setminus": 411,
  "\\framebox": 412,
  "?": 413,
  "\\hrule": 414,
  "\\m": 415,
  "\\renewcommand": 416,
  "\\arccos": 417,
  "\\searrow": 418,
  "\\lower": 419,
  "\\b": 420,
  "\\mkern": 421,
  "\\bigcap": 422,
  "\\sec": 423,
  "\\natural": 424,
  "\\hfil": 425,
  "\\rlap": 426,
  "\\textit": 427,
  "\\diamondsuit": 428,
  "\\space": 429,
  "\\vector": 430,
  "\\ker": 431,
  "\\pmod": 432,
  "\\texttt": 433,
  "\\smash": 434,
  "\\ddagger": 435,
  "\\csc": 436,
  "\\Downarrow": 437,
  "\\top": 438,
  "\\nearrow": 439,
  "\\thicklines": 440,
  "\\exists": 441,
  "\\sc": 442,
  "\\triangleright": 443,
  "\\LARGE": 444,
  "\\vdash": 445,
  "\\&": 446,
  "\\bigcirc": 447,
  "\\surd": 448,
  "\\bigm": 449,
  "\\bordermatrix": 450,
  "\\hphantom": 451,
  "\\textnormal": 452,
  "\\swarrow": 453,
  "\\normalsize": 454,
  "\\arraycolsep": 455,
  "\\sqcup": 456,
  "\\mathrel": 457,
  "\\special": 458,
  "\\mathbin": 459,
  "\\lefteqn": 460,
  "\\Huge": 461,
  "\\]": 462,
  "\\[": 463,
  "\\cite": 464,
  "\\lceil": 465,
  "\\inf": 466,
  "\\'": 467,
  "\\AA": 468,
  "\\textsf": 469,
  "\\footnote": 470,
  "\\supseteq": 471,
  "\\ensuremath": 472,
  "\\unboldmath": 473,
  "\\smile": 474,
  "\\Biggm": 475,
  "\\sqcap": 476,
  "\\multiput": 477,
  "\\oval": 478,
  "\\itshape": 479,
  "\\(": 480,
  "\\)": 481,
  "\\~": 482,
  "\\do": 483,
  "\\rightarrowfill": 484,
  "": 485,
  "\\asymp": 486,
  "\\Bigm": 487,
  "\\qbezier": 488,
  "\\lq": 489,
  "\\ae": 490,
  "\\prec": 491,
  "\\emph": 492,
  "\\ooalign": 493,
  "\\crcr": 494,
  "\\Longleftarrow": 495,
  "\\ss": 496,
  "\\$": 497,
  "\\triangleleft": 498,
  "\\mathopen": 499,
  "\\mathclose": 500,
  "\\nulldelimiterspace": 501,
  "\\amalg": 502,
  "\\rightleftharpoons": 503,
  "\\ddag": 504,
  "\\lgroup": 505,
  "\\rgroup": 506,
  "\\grave": 507,
  "\\bigskip": 508,
  "\\succeq": 509,
  "\\linethickness": 510,
  "\\bigsqcup": 511,
  "\\preceq": 512,
  "\\succ": 513,
  "\\oslash": 514,
  "\\setcounter": 515,
  "\\arrowvert": 516,
  "\\vcenter": 517,
  "\\mathord": 518,
  "\\skew": 519,
  "\\notin": 520,
  "\\fboxsep": 521,
  "\\nwarrow": 522,
  "\\smallint": 523,
  "\\mathtt": 524,
  "\\huge": 525,
  "\\mathstrut": 526,
  "\\vss": 527,
  "\\em": 528,
  "\\limsup": 529,
  "ç": 530,
  "\\symbol": 531,
  "§": 532,
  "\\ointop": 533,
  "\\verb": 534,
  "\\nolinebreak": 535,
  "\\SS": 536,
  "\\mathversion": 537,
  "\\footnotemark": 538,
  "\\tabcolsep": 539,
  "Ê": 540,
  "\\atopwithdelims": 541,
  "\\lg": 542,
  "\\\t": 543,
  "\\mathnormal": 544,
  "¡": 545,
  "\\mskip": 546,
  "\\cline": 547,
  "\\hss": 548
}